MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX120F032C.atdf
         <register caption="Device Configuration Word 0" name="DEVCFG0" initval="0x7FFFFFFB">
            <bitfield caption="Background Debugger Enable bits (forced to 11 if code-protect is enabled)" mask="0x3" name="DEBUG" values="DEVCFG0__DEBUG" />
            <bitfield caption="JTAG Enable bit" mask="0x4" name="JTAGEN" values="DEVCFG0__JTAGEN" />
            <bitfield caption="In-Circuit Emulator/Debugger Communication Channel Select bits" mask="0x18" name="ICESEL" values="DEVCFG0__ICESEL" />
            <bitfield caption="Program Flash Write-Protect bits" mask="0x7fc00" name="PWP" values="DEVCFG0__PWP" />
            <bitfield caption="Boot Flash Write-Protect bit" mask="0x1000000" name="BWP" values="DEVCFG0__BWP" />
            <bitfield caption="Code-Protect bit" mask="0x10000000" name="CP" values="DEVCFG0__CP" />
         </register>
      </register-group>
      <value-group caption="UserID" name="DEVCFG3__USERID">
         <value caption="User ID" name="" />
      </value-group>
      <value-group caption="Peripheral Module Disable Configuration bit" name="DEVCFG3__PMDL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Pin Select Configuration bit" name="DEVCFG3__IOL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="PLL Input Divider bits" name="DEVCFG2__FPLLIDIV">
         <value caption="1x Divider" name="DIV_1" value="0x0" />
         <value caption="2x Divider" name="DIV_2" value="0x1" />
         <value caption="3x Divider" name="DIV_3" value="0x2" />
         <value caption="4x Divider" name="DIV_4" value="0x3" />
         <value caption="5x Divider" name="DIV_5" value="0x4" />
         <value caption="6x Divider" name="DIV_6" value="0x5" />
         <value caption="10x Divider" name="DIV_10" value="0x6" />
         <value caption="12x Divider" name="DIV_12" value="0x7" />
      </value-group>
      <value-group caption="PLL Multiplier bits" name="DEVCFG2__FPLLMUL">
         <value caption="15x Multiplier" name="MUL_15" value="0x0" />
         <value caption="16x Multiplier" name="MUL_16" value="0x1" />
         <value caption="17x Multiplier" name="MUL_17" value="0x2" />
         <value caption="18x Multiplier" name="MUL_18" value="0x3" />
         <value caption="19x Multiplier" name="MUL_19" value="0x4" />
         <value caption="20x Multiplier" name="MUL_20" value="0x5" />
         <value caption="21x Multiplier" name="MUL_21" value="0x6" />
         <value caption="24x Multiplier" name="MUL_24" value="0x7" />
      </value-group>
      <value-group caption="Default PLL Output Divisor bits" name="DEVCFG2__FPLLODIV">
         <value caption="PLL Divide by 1" name="DIV_1" value="0x0" />
         <value caption="PLL Divide by 2" name="DIV_2" value="0x1" />
         <value caption="PLL Divide by 4" name="DIV_4" value="0x2" />
         <value caption="PLL Divide by 8" name="DIV_8" value="0x3" />
         <value caption="PLL Divide by 16" name="DIV_16" value="0x4" />
         <value caption="PLL Divide by 32" name="DIV_32" value="0x5" />
         <value caption="PLL Divide by 64" name="DIV_64" value="0x6" />
         <value caption="PLL Divide by 256" name="DIV_256" value="0x7" />
      </value-group>
      <value-group caption="Oscillator Selection bits" name="DEVCFG1__FNOSC">
         <value caption="Fast RC Osc (FRC)" name="FRC" value="0x0" />
         <value caption="Fast RC Osc with PLL" name="FRCPLL" value="0x1" />
         <value caption="Primary Osc (XT,HS,EC)" name="PRI" value="0x2" />
         <value caption="Primary Osc w/PLL (XT+,HS+,EC+PLL)" name="PRIPLL" value="0x3" />
         <value caption="Low Power Secondary Osc (SOSC)" name="SOSC" value="0x4" />
         <value caption="Low Power RC Osc (LPRC)" name="LPRC" value="0x5" />
         <value caption="Fast RC Osc w/Div-by-16 (FRC/16)" name="FRCDIV16" value="0x6" />
         <value caption="Fast RC Osc w/Div-by-N (FRCDIV)" name="FRCDIV" value="0x7" />
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="DEVCFG1__FSOSCEN">
         <value caption="Disable Secondary Oscillator" name="OFF" value="0x0" />
         <value caption="Enable Secondary Oscillator" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Internal External Switchover bit" name="DEVCFG1__IESO">
         <value caption="Internal External Switchover mode is disabled (Two-Speed Start-up is disabled)" name="OFF" value="0x0" />
         <value caption="Internal External Switchover mode is enabled (Two-Speed Start-up is enabled)" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Primary Oscillator Configuration bits" name="DEVCFG1__POSCMOD">
         <value caption="External clock mode" name="EC" value="0x0" />
         <value caption="XT osc mode" name="XT" value="0x1" />
         <value caption="HS osc mode" name="HS" value="0x2" />
         <value caption="Primary osc disabled" name="OFF" value="0x3" />
      </value-group>
      <value-group caption="CLKO Enable Configuration bit" name="DEVCFG1__OSCIOFNC">
         <value caption="CLKO output disabled" name="OFF" value="0x1" />
         <value caption="CLKO output signal active on the OSCO pin" name="ON" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus Clock Divisor Default Value bits" name="DEVCFG1__FPBDIV">
         <value caption="Pb_Clk is Sys_Clk/1" name="DIV_1" value="0x0" />
         <value caption="Pb_Clk is Sys_Clk/2" name="DIV_2" value="0x1" />
         <value caption="Pb_Clk is Sys_Clk/4" name="DIV_4" value="0x2" />
         <value caption="Pb_Clk is Sys_Clk/8" name="DIV_8" value="0x3" />
      </value-group>
      <value-group caption="Clock Switching and Monitor Selection Configuration bits" name="DEVCFG1__FCKSM">
         <value caption="Clock Switch Enable, FSCM Enabled" name="CSECME" value="0x0" />
         <value caption="Clock Switch Enable, FSCM Disabled" name="CSECMD" value="0x1" />
         <value caption="Clock Switch Disable, FSCM Disabled" name="CSDCMD" value="0x3" />
      </value-group>
      <value-group caption="Watchdog Timer Postscale Select bits" name="DEVCFG1__WDTPS">
         <value caption="1:1" name="PS1" value="0x0" />
         <value caption="1:2" name="PS2" value="0x1" />
         <value caption="1:4" name="PS4" value="0x2" />
         <value caption="1:8" name="PS8" value="0x3" />
         <value caption="1:16" name="PS16" value="0x4" />
         <value caption="1:32" name="PS32" value="0x5" />
         <value caption="1:64" name="PS64" value="0x6" />
         <value caption="1:128" name="PS128" value="0x7" />
         <value caption="1:256" name="PS256" value="0x8" />
         <value caption="1:512" name="PS512" value="0x9" />
         <value caption="1:1024" name="PS1024" value="0xa" />
         <value caption="1:2048" name="PS2048" value="0xb" />
         <value caption="1:4096" name="PS4096" value="0xc" />
         <value caption="1:8192" name="PS8192" value="0xd" />
         <value caption="1:16384" name="PS16384" value="0xe" />
         <value caption="1:32768" name="PS32768" value="0xf" />
         <value caption="1:65536" name="PS65536" value="0x10" />
         <value caption="1:131072" name="PS131072" value="0x11" />
         <value caption="1:262144" name="PS262144" value="0x12" />
         <value caption="1:524288" name="PS524288" value="0x13" />
         <value caption="1:1048576" name="PS1048576" value="0x14" />
      </value-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="DEVCFG1__WINDIS">
         <value caption="Watchdog Timer is in Window Mode" name="ON" value="0x0" />
         <value caption="Watchdog Timer is in Non-Window Mode" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="DEVCFG1__FWDTEN">
         <value caption="Watchdog Timer is not enabled; it can be enabled in software" name="OFF" value="0x0" />
         <value caption="Watchdog Timer is enabled and cannot be disabled by software" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Watchdog Timer Window Size bits" name="DEVCFG1__FWDTWINSZ">
         <value caption="Window Size is 75%" name="WINSZ_75" value="0x0" />
         <value caption="Window Size is 50%" name="WINSZ_50" value="0x1" />
         <value caption="Window Size is 37.5%" name="WINSZ_37" value="0x2" />
         <value caption="Window Size is 25%" name="WINSZ_25" value="0x3" />
      </value-group>
      <value-group caption="Background Debugger Enable bits (forced to 11 if code-protect is enabled)" name="DEVCFG0__DEBUG">
         <value caption="Debugger is Enabled" name="ON" value="0x0" />
         <value caption="Debugger is Disabled" name="OFF" value="0x3" />
      </value-group>
